[
  {
    "title": "Samsung Galaxy S24 Ultra 5G AI Smartphone (Titanium Black, 12GB, 512GB Storage)",
    "price": "1,39,999",
    "rating": "4.4 out of 5 stars",
    "url": "https://www.amazon.in/sspa/click?ie=UTF8&spc=MTo3NTUwNDU3NDc5NDg3ODk4OjE3MjIyMzQxMzY6c3BfYXRmOjMwMDI1MzU1ODI5MjYzMjo6MDo6&url=%2FSamsung-Galaxy-Smartphone-Titanium-Storage%2Fdp%2FB0CS5Y7H6T%2Fref%3Dsr_1_1_sspa%3Fcrid%3D2H2MP01Y02K4C%26dib%3DeyJ2IjoiMSJ9.YS4iBR86DTuZz_tuZiFRU3184EPW_iifJvgpxPpKoN3Pgnz0q55s3FZRMSz-w2Nx2nkuDCWROQbB3nYpMhMSMIlFLCQf2asIM8pn9W1k30qbvQbn1bHS69VXJ015ovs9-dK61WQghhTMnIWOIGhKwlJkD9MNPhUYWXQB5sz5i0UxUnBqp7AdxJ0Dr28686jedRREsEc7UUqfVW2oXaOVwv0omB98JZt1eLq0duP_PY4.dwPXq5DpcbGJd-REEK1vbO2JyQdRC54WXLZ-sP4wB7I%26dib_tag%3Dse%26keywords%3Dsmartphones%26qid%3D1722234136%26sprefix%3D%252Caps%252C185%26sr%3D8-1-spons%26sp_csd%3Dd2lkZ2V0TmFtZT1zcF9hdGY%26psc%3D1",
    "reviews": [
      "A big ass phone with a stylus is just what I needed.\nMake sure you have big hands , cause it's definitely not a one handed phone, if you can use it , well good for you!\nPictures are amazing the camera is the best feature, the smoothness of the UI, the processor is fast as flash! 45w charging is pretty fast tbh in a real day usage. Battery is really good so far. Coming to display, just a wow. Speakers are also good, connectivity is good, almost all areas I get good 5g airtel or jio network. Stylus is just a cherry on top. If you are someone like me who takes quick notes on the phone, use the stylus, makes it more stylishly stylush, ifykwim.\nAll in all a value for money smartphone if you are really into high end phones! Worth the name Ultra! Rest is your choice. For accessories like covers or screen guards look for esr or spigen or others as well. No charger on the box so get your own, 25w is also good enough, but I recommend a Gan charger for optimised charging: ambrane is good.\n\nBut one thing, fingerprint with a screenguard on, will not work as expected. I will say 6/10 times it will work, for me not a deal breaker if it is for you, then explore something else. Without a screenguard, you are risking the beautiful display but you will be able to see how good the display is actually currently the best in the market. Fingerprints read all the time and ultra fast without screenguard, as samsung fingerprint reads are different to that of say, oneplus!",
      "Booked my 12+512gb version as soon as it was launched. And after using it for more than a month, here's my review.\nPros\n1) exceptional camera quality. The 12MP ultra-wide does it's job and I would say going for 5x optical zoom with 50MP sensor instead for 10x 10MP sensor is a better choice as upto 30x I would say the pictures are more crisp than S23 ultra.\n\n2) Build quality is premium. It feels like a high budget smartphone. Not sure if titanium armor is enough to withstand high drop possibilities, but it does make it lighter.\n\n3) Screen is a big improvement. The anti reflective Corning Gorilla glass armor does it's job and reflects most of the glare so you can sit easily and watch without worrying if the person sitting next to you is watching coz they can't. 😁\n\n3) S-pen has improved a bit. A lot of people are saying that they don't use it much after first time, but that's not the case with me. If you will get the hang of it, you will use it quite often.\n\n4) AI interface is quite excellent. Although in initial phase, it does it's job in notes and summarising big pages so that you can easily get the gist.\n\n5) 7 years OS and security update is a big big up from my side.\n\n6) The box like built rather than a curve display is a better choice. It's easier to find a screen protector.\n\n7) sanpdragan 8 gen3 is fast. You can play high end games at maximum capacity. Android 14 with one UI 6 is smooth as you can hope it would be. I haven't recorded any lags or heating issues as for now.\n\nCons\n1) Anti refective display works until you put the above mention screen protector. After that it won't work with that precision. Although it still does it's job.\n\n2) Selfie camera is still not that great if you're using iPhone 14 or 15 pro.\n\n3) generative AI is not that great in calls and photo editing. Also, to pay for these services after 2025 is a big drawback from Samsung.\n\n4) Samsung is still not implementing faster charging protocols on their high and mid range smartphones. In a time when OnePlus is offering 100W charging speeds and xiomi offering 50-80W wireless charging, Samsung is still stuck with 45W and 15W wireless charging. Big drawback. However, battery do last for a full day.\n\n5) speaking of charging, no charger included is a serious letdown when you're spending more than a lac on a high end smartphone. Samsung, it doesn't feels good. 😔\n\nOverall, a good smartphone if you're thinking to go for a big one for a long time.",
      "In a simple word,\nDisplay - 9.5/10 (If you want to exploit the latest anti reflection coating you must not apply Tempered glass)\n\nBattery - 8/10 (Overall Good)\n\nProcessor - 9/10 (fast enough)\n\nUI - 10/10 (Too many customization)\n\nFast Charging - 8/10\n\nFingerprint Sensor -\n9/10 if no tempered glass (used for a very little span of time as attached tempered glass after a day)\n6/10 if tempered glass attached (most people use tempered glass)\n\nHaptics - 7/10 (Not too good, expected more)\n\nLoud Speaker - 8/10 (Quite Loud, crystal clear, good separation of frequencies)\n\nEarphone Output - 9/10 (Undoubtedly one of the best in the segment)\n\nSPen - 8/10 (Not too useful in daily life for a normal user)\n\nGalaxy AI - 7/10 (Used circle to search, Photo Edit features etc mostly)\n\nBuild Quality - 8.5/10 (A perfectly weight balanced phone, premium material, matte glass back beautiful)\n\n=====Camera =====\n(Both photo and video)\nMain Lens - 8.5/10\nUltra Wide Lens - 8.5/10\n3X Zoom Lens - 7/10 (Poor Low Light performance)\n5X Zoom Lens - 9.5/10\nFlash Intentity - 7/10 (Expected more from a flagship phone)\nStabilazation - 9/10\nSlowMo - 8.5/10\nFast moving object shoot - 7/10\n\nFront Camera - 9.5/10\n\nCons:\n1. At darkeness minimum brightness is too high.\n2. Phone gets pretty warm (38 - 42 deg Cel) while using 5G, Camera continuously.\n3. Camera app Unnecessarily boosts the images sometime, mostly low light photos, thus ruins the natural color and tone.\n4. No pro mode after 10x zoom.\n5. Expert RAW app is not very user friendly.\n6. Most annoying is the fingerprint scanner after applying the tempered glass.\n\nOverall Rating - 8.5/10",
      "The device has proven to be a remarkable technological advancement, offering exceptional performance and user satisfaction. Since its initial release, I have personally utilized it and can attest to its seamless operation and rapid processing speed. Additionally, the audio quality is commendable, and the camera captures stunning images. The integration of AI features further enhances its capabilities, making it a truly remarkable device. However, the battery life could be improved to provide a more extended usage time."
    ]
  },
  {
    "title": "Redmi Note 13 5G (Arctic White, 6GB RAM, 128GB Storage) | 5G Ready | 120Hz Bezel-Less AMOLED | 7.mm Slimmest Note Ever | 108MP Pro-Grade Camera",
    "price": "16,999",
    "rating": "3.7 out of 5 stars",
    "url": "https://www.amazon.in/sspa/click?ie=UTF8&spc=MTo3NTUwNDU3NDc5NDg3ODk4OjE3MjIyMzQxMzY6c3BfYXRmOjMwMDExODYxMjg3NTMzMjo6MDo6&url=%2FRedmi-Storage-Bezel-Less-Slimmest-Pro-Grade%2Fdp%2FB0CQPGG8KG%2Fref%3Dsr_1_2_sspa%3Fcrid%3D2H2MP01Y02K4C%26dib%3DeyJ2IjoiMSJ9.YS4iBR86DTuZz_tuZiFRU3184EPW_iifJvgpxPpKoN3Pgnz0q55s3FZRMSz-w2Nx2nkuDCWROQbB3nYpMhMSMIlFLCQf2asIM8pn9W1k30qbvQbn1bHS69VXJ015ovs9-dK61WQghhTMnIWOIGhKwlJkD9MNPhUYWXQB5sz5i0UxUnBqp7AdxJ0Dr28686jedRREsEc7UUqfVW2oXaOVwv0omB98JZt1eLq0duP_PY4.dwPXq5DpcbGJd-REEK1vbO2JyQdRC54WXLZ-sP4wB7I%26dib_tag%3Dse%26keywords%3Dsmartphones%26qid%3D1722234136%26sprefix%3D%252Caps%252C185%26sr%3D8-2-spons%26sp_csd%3Dd2lkZ2V0TmFtZT1zcF9hdGY%26psc%3D1",
    "reviews": [
      "Look like smart but.... Batter y capacity was too bad..... And the gaming experience was good..... And camera quality was very best.",
      "Light weight,Extra slim, Great screen, clarityand superb battery and camera. Not as much negative as the comments posted here. Good phone for budget price. heating issue is the only drawback i experience. Good sound but some sound features not working",
      "Ghatiya phone, regretting q buy kiya isse, sometimes phone lag, sound quality bakwaas, camera quality and features theek thaak, U can't pass all kernal version test, slow charging, ultra thin bezels bol bol k sirf bewakoof bna rha hai, phone actual price is around 15000 rest is taxes but ye phone 15000 v deserve ni krta, main redmi user hu mote than 7 yrs se isliye low rating v dekh k buy kiya but m regretting now, 8k ka redmi ka koi phone lelo wo isse accha milega but dont go for it, after 1 day of buying cashify mein v mera buying cost ni nikal rha hai iss phone ka, worst experience",
      "The battery life and camera,Display Quality and sound system are the most significant improvements in the Mobile.value for money",
      "Reviewing after using 1month. Look wise this phone is superb. Camera is average ,not seems like 108mp camera. No hang is there. Very good touch experience. Charging is also superfast.\nSince I have noticed 2 issues.\n1. Battery is draining too fast.\n2. Heating issue is also there.",
      "If you are looking for phone with 15k to 20k range then this is worth and all rounder phone.\nCamera , display, battery , looks , performance in each area this phone brings value and it si worth buying this. you will get charger and cover inside the box and i opted for faster delivery which was delivered in less than 24 hours .",
      "Very slow performance, very useless phone\nIf you take my advice then never purchase it.",
      "Such a good product so happy with by it good camera quality and overall performance is great 👍"
    ]
  },
  {
    "title": "POCO C65 (Matte Black 4GB RAM 128GB Storage)",
    "price": "6,999",
    "rating": "4.0 out of 5 stars",
    "url": "https://www.amazon.in/POCO-C65-Matte-Black-128GB/dp/B0CQG9N4Z3/ref=sr_1_3?crid=2H2MP01Y02K4C&dib=eyJ2IjoiMSJ9.YS4iBR86DTuZz_tuZiFRU3184EPW_iifJvgpxPpKoN3Pgnz0q55s3FZRMSz-w2Nx2nkuDCWROQbB3nYpMhMSMIlFLCQf2asIM8pn9W1k30qbvQbn1bHS69VXJ015ovs9-dK61WQghhTMnIWOIGhKwlJkD9MNPhUYWXQB5sz5i0UxUnBqp7AdxJ0Dr28686jedRREsEc7UUqfVW2oXaOVwv0omB98JZt1eLq0duP_PY4.dwPXq5DpcbGJd-REEK1vbO2JyQdRC54WXLZ-sP4wB7I&dib_tag=se&keywords=smartphones&qid=1722234136&sprefix=%2Caps%2C185&sr=8-3",
    "reviews": [
      "\"I was pleasantly surprised by the Focus C65, a budget-friendly smartphone that packs a punch. As a casual photographer, I wanted a device that could handle basic photography tasks without breaking the bank. The Focus C65 delivers.\n\nThe camera app is intuitive, and the image quality is impressive for the price range.\nThe Focus C65 may not be a flagship device, but it's a great option for those on a budget. It's a solid all-rounder that covers the basics and then some.\n\n- Budget-friendly\n- Decent camera performance\n- Good display quality\n- Long battery\n\n- Not suitable for heavy gaming or professional photography\n- Limited storage (expandable via microSD)\n\nOverall, the Focus C65 is a great value for its price. Highly recommended for those on a budget!\"",
      "POCO is the one which get at thisnprice is nice and good for normal usage. Mobile speed is fine. Good at this price range. Camera and battery life is well.",
      "Superb performance at affordable price",
      "The Poco C65 is a good option for those looking for a budget phone around 6.5k. Here are the pros and cons:\n\nPros:\n- Affordable:- Great value for the price.\n- Display:- Good quality for its price segment.\n- Design:- The plastic back looks amazing, especially in black.\n- Performance:- Handles basic daily tasks well.\n- Call Recording:- Useful feature included.\n\nCons:\n- Bloatware:- Comes with over 50 pre-installed, mostly useless apps.\n- Heating:- Tends to overheat, which is a big issue.\n- Ergonomics:- Not comfortable for one-handed use.\n- Sound Quality:- Poor audio performance.\n- Camera:- Below average; can take normal photos but other features are disappointing.\n-Connectivity:- Connectivity really sucks, with frequent drops and slow internet speeds.\n\nVerdict: In summary, after 50 days of usage, the Poco C65 is a solid choice for budget-conscious buyers around 6.5k. However, it is not worth considering if priced above 7.5k due to its limitations.",
      "Good design and build quality.\nGood battery performance\nWorth for money",
      "For the price range, this is an excellent device.\nI highly recommend this phone if you're a casual user (Facebook, Instagram, WhatsApp), as well as a mediocre gamer. With the medium settings, Pokemon Unite hasn't slowed down or overheated for me.\n\nThe camera is decent enough to capture good images unless you are a professional photographer.\n\nThe only problem is charging, 10w brick takes forever to charge so I would recommend you to get a fast charger nevertheless it has an excellent battery life.",
      "What ever I spent the money for this mobile.. it's a completely worthable..\n\nAbout quality, finger sensor, appearance to goes smooth\n\nBarrery life pleasetry to improve in update versions..",
      "Quality of the phone exterior is good, it's not a great build but worth the money. Now the UI experience is again not so fast, but works well for a budget friendly phone. Colour ratio on screen is great. Camera is great. My 1st budget friendly phone which is great. Fingerprint is good and fast. Charging is slow with the given adapter. Overall for 6.8k I will not say it's bad neither mind-blowing."
    ]
  },
  {
    "title": "Redmi 13C (Stardust Black, 6GB RAM, 128GB Storage) | Powered by 4G MediaTek Helio G85 | 90Hz Display | 50MP AI Triple Camera",
    "price": "8,499",
    "rating": "4.1 out of 5 stars",
    "url": "https://www.amazon.in/Stardust-Storage-Powered-MediaTek-Display/dp/B0CMTW9MVK/ref=sr_1_4?crid=2H2MP01Y02K4C&dib=eyJ2IjoiMSJ9.YS4iBR86DTuZz_tuZiFRU3184EPW_iifJvgpxPpKoN3Pgnz0q55s3FZRMSz-w2Nx2nkuDCWROQbB3nYpMhMSMIlFLCQf2asIM8pn9W1k30qbvQbn1bHS69VXJ015ovs9-dK61WQghhTMnIWOIGhKwlJkD9MNPhUYWXQB5sz5i0UxUnBqp7AdxJ0Dr28686jedRREsEc7UUqfVW2oXaOVwv0omB98JZt1eLq0duP_PY4.dwPXq5DpcbGJd-REEK1vbO2JyQdRC54WXLZ-sP4wB7I&dib_tag=se&keywords=smartphones&qid=1722234136&sprefix=%2Caps%2C185&sr=8-4",
    "reviews": [
      "If you want a phone under 10k for daily use or for the use of elders, then this is the one to choose. It has adequate fast charging, battery lasts a full day and more on a normal use, it looks actually great, the performance is good and the camera is adequate too.",
      "This phone is one of the best phone under 20000,the camera is also nice but this phone is a bit laggy , but overall it's nice and can work for 2 years very easily.",
      "Mobile is very gud family wise and very helpful for homies and all battery life is too gud and appearance is delicate and connectivity is flawless as well as picture quality is too gud indor and outdoor in this budget along with good processor with great gaming experience and the brightness is also seameass in open light.",
      "90hz screen but good qaulity screen\n50mp camera but quality was poor\n1080p video quality is ok\nFunction smoothly\nIt's not for high revolution game\nAnd HD video",
      "camera quality also good",
      "Delivery speed and efficiency was good.\nAs I bought on Amazon Day, it looks to be a good price.\nThe mobile phone performance so far looks good and hope it continues this way.",
      "Very Good Product worth for the bucks got it on Amazon Prime Day for less than 3000/- Amazon giving great discounts for prompt delivery\nThanks,\nVijay",
      "After 3days of usage for 6/128gb phone myoverall experience is good whether it comes in terms for camera clarity, games, phone system processor.,display quality is very good as compare to price range of this phone. No heating issues and no lagging issues were found till now\nCons -speaker Sound of this phone is not upto the mark quality need to be improved .\nBattery 🔋drains very early as compare to other phones with same battery size. As I have to charge my new phone twice due to heavy internet usage.\n\n🔋⚡ takes approx more than 2hours to be full .\n\nNo quick charging is there in this phone.\n\nOverall we can consider this phone if u are okay with the battery 🔋in this budget."
    ]
  },
  {
    "title": "Redmi 13C (Starshine Green, 4GB RAM, 128GB Storage) | Powered by 4G MediaTek Helio G85 | 90Hz Display | 50MP AI Triple Camera",
    "price": "7,699",
    "rating": "4.1 out of 5 stars",
    "url": "https://www.amazon.in/Starshine-Storage-Powered-MediaTek-Display/dp/B0CMTZNPXR/ref=sr_1_5?crid=2H2MP01Y02K4C&dib=eyJ2IjoiMSJ9.YS4iBR86DTuZz_tuZiFRU3184EPW_iifJvgpxPpKoN3Pgnz0q55s3FZRMSz-w2Nx2nkuDCWROQbB3nYpMhMSMIlFLCQf2asIM8pn9W1k30qbvQbn1bHS69VXJ015ovs9-dK61WQghhTMnIWOIGhKwlJkD9MNPhUYWXQB5sz5i0UxUnBqp7AdxJ0Dr28686jedRREsEc7UUqfVW2oXaOVwv0omB98JZt1eLq0duP_PY4.dwPXq5DpcbGJd-REEK1vbO2JyQdRC54WXLZ-sP4wB7I&dib_tag=se&keywords=smartphones&qid=1722234136&sprefix=%2Caps%2C185&sr=8-5",
    "reviews": [
      "If you want a phone under 10k for daily use or for the use of elders, then this is the one to choose. It has adequate fast charging, battery lasts a full day and more on a normal use, it looks actually great, the performance is good and the camera is adequate too.",
      "This phone is one of the best phone under 20000,the camera is also nice but this phone is a bit laggy , but overall it's nice and can work for 2 years very easily.",
      "Mobile is very gud family wise and very helpful for homies and all battery life is too gud and appearance is delicate and connectivity is flawless as well as picture quality is too gud indor and outdoor in this budget along with good processor with great gaming experience and the brightness is also seameass in open light.",
      "90hz screen but good qaulity screen\n50mp camera but quality was poor\n1080p video quality is ok\nFunction smoothly\nIt's not for high revolution game\nAnd HD video",
      "camera quality also good",
      "Delivery speed and efficiency was good.\nAs I bought on Amazon Day, it looks to be a good price.\nThe mobile phone performance so far looks good and hope it continues this way.",
      "Very Good Product worth for the bucks got it on Amazon Prime Day for less than 3000/- Amazon giving great discounts for prompt delivery\nThanks,\nVijay",
      "After 3days of usage for 6/128gb phone myoverall experience is good whether it comes in terms for camera clarity, games, phone system processor.,display quality is very good as compare to price range of this phone. No heating issues and no lagging issues were found till now\nCons -speaker Sound of this phone is not upto the mark quality need to be improved .\nBattery 🔋drains very early as compare to other phones with same battery size. As I have to charge my new phone twice due to heavy internet usage.\n\n🔋⚡ takes approx more than 2hours to be full .\n\nNo quick charging is there in this phone.\n\nOverall we can consider this phone if u are okay with the battery 🔋in this budget."
    ]
  }
]